#+setupfile: ../../research.org

#+title: Traffic Sign Classification
#+date: Updated: \today
#+author: Lewis Collum
*Started 02/09/2020*

** COMMENT Class Printout
   #+begin_src python
import common

for i, name in enumerate(batch.signNames):
    print(i, name)
   #+end_src

   #+RESULTS:
   #+begin_example
  0 Speed limit (20km/h)
  1 Speed limit (30km/h)
  2 Speed limit (50km/h)
  3 Speed limit (60km/h)
  4 Speed limit (70km/h)
  5 Speed limit (80km/h)
  6 End of speed limit (80km/h)
  7 Speed limit (100km/h)
  8 Speed limit (120km/h)
  9 No passing
  10 No passing for vehicles over 3.5 metric tons
  11 Right-of-way at the next intersection
  12 Priority road
  13 Yield
  14 Stop
  15 No vehicles
  16 Vehicles over 3.5 metric tons prohibited
  17 No entry
  18 General caution
  19 Dangerous curve to the left
  20 Dangerous curve to the right
  21 Double curve
  22 Bumpy road
  23 Slippery road
  24 Road narrows on the right
  25 Road work
  26 Traffic signals
  27 Pedestrians
  28 Children crossing
  29 Bicycles crossing
  30 Beware of ice/snow
  31 Wild animals crossing
  32 End of all speed and passing limits
  33 Turn right ahead
  34 Turn left ahead
  35 Ahead only
  36 Go straight or right
  37 Go straight or left
  38 Keep right
  39 Keep left
  40 Roundabout mandatory
  41 End of no passing
  42 End of no passing by vehicles over 3.5 metric tons
   #+end_example
  
* Model: LeNet
  =model.py=
  #+begin_src python :tangle source/model.py
import keras
import keras.layers as layers

import batch
 
model = keras.models.Sequential()

for i in range(3):
    model.add(layers.Conv2D(filters=32*2**i, kernel_size=(3, 3), activation='relu', input_shape=batch.imageShape))
    model.add(layers.Dropout(0.1))
    model.add(layers.MaxPool2D(pool_size=(2, 2)))

model.add(layers.Flatten())

model.add(layers.Dense(units=120, activation='relu'))
model.add(layers.Dense(units=84, activation='relu'))
model.add(layers.Dense(units=batch.classCount, activation = 'softmax'))

if __name__ == '__main__':
    print(model.summary())
  #+end_src

  #+RESULTS:
  #+begin_example
  Found 31368 images belonging to 43 classes.
  Found 7841 images belonging to 43 classes.
  Model: "sequential_1"
  _________________________________________________________________
  Layer (type)                 Output Shape              Param #   
  =================================================================
  conv2d_1 (Conv2D)            (None, 30, 30, 32)        320       
  _________________________________________________________________
  dropout_1 (Dropout)          (None, 30, 30, 32)        0         
  _________________________________________________________________
  max_pooling2d_1 (MaxPooling2 (None, 15, 15, 32)        0         
  _________________________________________________________________
  conv2d_2 (Conv2D)            (None, 13, 13, 64)        18496     
  _________________________________________________________________
  dropout_2 (Dropout)          (None, 13, 13, 64)        0         
  _________________________________________________________________
  max_pooling2d_2 (MaxPooling2 (None, 6, 6, 64)          0         
  _________________________________________________________________
  conv2d_3 (Conv2D)            (None, 4, 4, 128)         73856     
  _________________________________________________________________
  dropout_3 (Dropout)          (None, 4, 4, 128)         0         
  _________________________________________________________________
  max_pooling2d_3 (MaxPooling2 (None, 2, 2, 128)         0         
  _________________________________________________________________
  flatten_1 (Flatten)          (None, 512)               0         
  _________________________________________________________________
  dense_1 (Dense)              (None, 120)               61560     
  _________________________________________________________________
  dropout_4 (Dropout)          (None, 120)               0         
  _________________________________________________________________
  dense_2 (Dense)              (None, 84)                10164     
  _________________________________________________________________
  dropout_5 (Dropout)          (None, 84)                0         
  _________________________________________________________________
  dense_3 (Dense)              (None, 43)                3655      
  _________________________________________________________________
  dropout_6 (Dropout)          (None, 43)                0         
  =================================================================
  Total params: 168,051
  Trainable params: 168,051
  Non-trainable params: 0
  _________________________________________________________________
  None
  #+end_example

* Testing
  #+begin_src python :tangle source/testing.py :var modelPath="../model/01/01.h5" :var testSetPath="../data/mytest"
import keras
from keras.models import load_model
from keras.preprocessing.image import ImageDataGenerator
import matplotlib.pyplot as pyplot
import numpy as np

import common
import preprocessing
import batch

model = load_model(modelPath)

test_generator = batch.batchGenerator.flow_from_directory(
    directory=testSetPath, 
    target_size=(common.imageSize, common.imageSize),
    color_mode='grayscale',
    shuffle=True,
    batch_size=1)

filenames = test_generator.filenames
nb_samples = len(filenames)

fig=pyplot.figure()
columns = 4
rows = 4

for i in range(1, columns*rows):
    x_batch, y_batch = test_generator.next()

    name = model.predict(x_batch)
    name = np.argmax(name, axis=-1)
    true_name = y_batch
    true_name = np.argmax(true_name, axis=-1)

    label_map = (batch.trainIterator.class_indices)
    label_map = dict((v,k) for k,v in label_map.items()) #flip k,v
    predictions = [label_map[k] for k in name]
    true_value = [label_map[k] for k in true_name]

    image = x_batch[0]
    fig.add_subplot(rows, columns, i)
    pyplot.axis('off')
    pyplot.title(f"guess: {predictions[0]}\nactual: {true_value[0]}")
    pyplot.imshow(image[:,:,0], cmap='gray')

pyplot.show()
  #+end_src

  #+RESULTS:
  : Found 31368 images belonging to 43 classes.
  : Found 7841 images belonging to 43 classes.
  : Found 2 images belonging to 1 classes.

